**** Functions and Functional Procedures
 
Mathematically a /function/ is just a /set of pairs/ which associate /elements/ in
some /domain type/ with elements in some /range (or co-domain) type/. In
Typed Racket we'd say that a function was a =(Setof (Pairof domain-type
range-type))=  There is a restriction: the domain elements must be unique, i.e.
there can only be one pair in the set with a given domain value.

In computing, a /procedural function/ takes a /value of a parameter type/ and
returns a /value of a result type/. The procedural function constructs the
function on demand.

Alternatively, we can simply construct a set of pairs to explicitly represent
the function. The latter would seem to only be able to represent functions which
are finite sets, but many computer languages allow infinite data structures,
although not all parts of those data structures can be materialized at once!

Here's an example in /Typed Racket/:

#+begin_src racket
   #lang typed/racket
  
  ;; The fibonacci function is a mapping from Integers to Integers 
  ;; The Range values can get uncomfortably large.  So we can
  ;; approximate the function with a mapping from Integers to FLonums
  ;; where FLonums are Floating Point approximatations.
  
   ;; A the approximate fibionacci function as a procedure
   (: fib (-> Integer Flonum))
   (define (fib n)
     (: fib (-> Integer Flonum Flonum Flonum))
     (define (fib n a b)
       (cond [(= 0 n) a]
             [(= 1 n) b]
             [else (fib (sub1 n) b (+ a b))] ) )
     (if (negative? n) 0.0 (fib n 0.0 1.0)) )
  
   ;; A the approximate fibionacci function as a set
   ;; specifically as an an infinite (Lazy) Sequence of Pairs
  ;; (in-naturals) returns the sequence of Integers starting with 0
   (: fib-seq (Sequenceof (Pairof Integer Flonum)))
   (define fib-seq (sequence-map (λ ([n : Integer]) (cons n (fib n))) (in-naturals)))
  
   ;; if a function is a set of pairs, here are some of them:
   (map (λ ([n : Integer]) (sequence-ref fib-seq n)) '(1 10 20))
#+end_src

#+RESULTS:
: ((1 . 1.0) (10 . 55.0) (20 . 6765.0))

